export type Category = '사료' | '간식' | '영양제';

interface SubCategories {
  [key: string]: string[];
}

export const subCategories: SubCategories = {
  사료: ['전체', '건식', '수제', '건조생식'],
  간식: ['전체', '캔/파우치', '건조간식', '져키'],
  영양제: ['전체', '캡슐', '알약', '스틱', '츄어블', '분말'],
};

// 사료 카테고리의 하위 카테고리에 대해 매핑 설정
export const foodTypeMapping = {
  사료: {
    전체: '전체',
    건식: '건식사료',
    수제: '수제사료',
    건조생식: '건조생식사료',
  },
  간식: {
    전체: '전체',
    '캔/파우치': '캔/파우치',
    건조간식: '건조간식',
    져키: '져키',
  },
  영양제: {
    전체: '전체',
    캡슐: '캡슐',
    알약: '알약',
    스틱: '스틱',
    츄어블: '츄어블',
    분말: '분말',
  },
};
